app/Controllers/Admin.php

    public function index(): string
    {
		$model = new AppointmentModel();
		$data['appointments'] = $model->orderBy('actual_time', 'DESC')->limit(5)->find();
		$model2 = new ContactModel();
		$data['contacts'] = $model2->orderBy('date', 'DESC')->limit(5)->find();
---
SELECT *
FROM `appointments`
ORDER BY `actual_time` DESC
 LIMIT 5
SELECT *
FROM `contacts`
ORDER BY `date` DESC
 LIMIT 5