app/Controllers/Appointment.php

	public function index() :string
	{
		$title = \App\Models\TitleModel::GetAppointmentContent();
		$model = new AppointmentModel();
		$data['appointments'] = $model->findAll();
---
SELECT *
FROM `appointments`