app/Controllers/Booked.php

	public function list()
	{
		$model = new AppointmentModel();
		$data['appointments'] = $model->orderBy('actual_time', 'DESC')->findAll();
---
SELECT *
FROM `appointments`
ORDER BY `actual_time` DESC

	public function edit($id)
	{
		$model = new AppointmentModel();
		$data['appointment'] = $model->find($id);
		$update = false;

		$post = $this->request->getPost();
		if($post)
		{
			$post['id'] = $id;
			$update = $model->save($post);

			if($update)
			{
				return $this->successfulEdit($model);
			}
		}

		$data['appointments'] = $model->orderBy('actual_time', 'DESC')->findAll();
---
SELECT *
FROM `appointments`
WHERE `appointments`.`id` = '238'
UPDATE `appointments` SET `name` = 'Nagy Lajos', `email` = 'lali@mail.hu', `phone` = '+36203425674', `service_type` = 'Arckezelés', `service_name` = 'Tini kezelés', `date` = '2024-07-26', `time` = '12:00:00', `id` = '238'
WHERE `appointments`.`id` IN ('238')
SELECT *
FROM `appointments`
ORDER BY `actual_time` DESC

	public function confirmDelete($id)
	{
		$model = new AppointmentModel();
		$data['appointment'] = $model->find($id);
---
SELECT *
FROM `appointments`
WHERE `appointments`.`id` = '239'

	private function successfulEdit($model)
	{
		$data['appointments'] = $model->orderBy('actual_time', 'DESC')->findAll();
---
SELECT *
FROM `appointments`
ORDER BY `actual_time` DESC