app/Controllers/Contacted.php

	public function confirmDelete($id)
	{
		$model = new ContactModel();
		$data['contact'] = $model->find($id);
---
SELECT *
FROM `contacts`
WHERE `contacts`.`id` = '50'