app/Controllers/Contacted.php

	public function list()
	{
		$model = new ContactModel();
		$data['contacts'] = $model->orderBy('date', 'DESC')->findAll();
---
SELECT *
FROM `contacts`
ORDER BY `date` DESC

	public function confirmDelete($id)
	{
		$model = new ContactModel();
		$data['contact'] = $model->find($id);
---
SELECT *
FROM `contacts`
WHERE `contacts`.`id` = '37'

	public function delete($id)
    {
        $model = new ContactModel();

        if ($model->delete($id))
		{
			$data['contacts'] = $model->orderBy('date', 'DESC')->findAll();
---
DELETE FROM `contacts`
WHERE `id` IN ('40')
SELECT *
FROM `contacts`
ORDER BY `date` DESC