app/Controllers/Services.php

	public function index(): string
	{
		$data_title = \App\Models\TitleModel::GetServicesContent();

		$model = model(\App\Models\ServicesModel::class);
		$data['services'] = $model->findAll();
---
SELECT *
FROM `services`

	public function list()
	{
		$model = new ServicesModel();
		$data['services'] = $model->findAll();
---
SELECT *
FROM `services`

	public function confirmDelete($id)
	{
		$model = new servicesModel();
		$data['service'] = $model->find($id);
---
SELECT *
FROM `services`
WHERE `services`.`id` = '22'

	public function delete($id)
    {
        $model = new ServicesModel();

        if ($model->delete($id))
		{
			$data['services'] = $model->findAll();
---
DELETE FROM `services`
WHERE `id` IN ('25')
SELECT *
FROM `services`